write -f Verilog -h -o ./netlist/a.v
write_sdf ./netlist/a.sdf
write_sdc ./netlist/a.sdc